{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[g_start]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[g_end]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[unknown]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[pad]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4096,
      "content": "<|begin_of_text|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4097,
      "content": "<|end_of_text|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4098,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFD"
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": " ?\\d+\\.|\\. ?| ?[-\\w]+|[#+]\\s+"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[unknown]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": true,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[g_start]": 0,
      "[g_end]": 1,
      "[unknown]": 2,
      "[pad]": 3,
      " ": 4,
      "#": 5,
      "+": 6,
      "-": 7,
      ".": 8,
      "0": 9,
      "1": 10,
      "2": 11,
      "3": 12,
      "4": 13,
      "5": 14,
      "6": 15,
      "7": 16,
      "8": 17,
      "9": 18,
      "=": 19,
      "B": 20,
      "K": 21,
      "N": 22,
      "O": 23,
      "Q": 24,
      "R": 25,
      "[": 26,
      "]": 27,
      "_": 28,
      "a": 29,
      "b": 30,
      "c": 31,
      "d": 32,
      "e": 33,
      "f": 34,
      "g": 35,
      "h": 36,
      "n": 37,
      "r": 38,
      "s": 39,
      "t": 40,
      "x": 41,
      " 1": 42,
      " 2": 43,
      " N": 44,
      " 3": 45,
      " R": 46,
      " B": 47,
      " Q": 48,
      "1.": 49,
      "4.": 50,
      "5.": 51,
      "xd": 52,
      "6.": 53,
      "7.": 54,
      "+ ": 55,
      "8.": 56,
      "9.": 57,
      "0.": 58,
      "2.": 59,
      "3.": 60,
      " 4": 61,
      "xe": 62,
      "f6": 63,
      "xc": 64,
      "f3": 65,
      " K": 66,
      "g_": 67,
      "-O": 68,
      "O-O": 69,
      "d4": 70,
      "e4": 71,
      " c": 72,
      "f4": 73,
      "c3": 74,
      "f5": 75,
      "e5": 76,
      " d": 77,
      "d7": 78,
      "xb": 79,
      "g5": 80,
      "e6": 81,
      " 5": 82,
      "e7": 83,
      "e3": 84,
      "c4": 85,
      "e2": 86,
      "g4": 87,
      "d2": 88,
      "g6": 89,
      "xd4": 90,
      "c6": 91,
      "d3": 92,
      "xd5": 93,
      "g3": 94,
      " b": 95,
      " a": 96,
      " Nf6": 97,
      "Nf3": 98,
      "g7": 99,
      "ar": 100,
      "en": 101,
      "st": 102,
      "g_en": 103,
      "g_st": 104,
      "art": 105,
      "g_end": 106,
      "g_start": 107,
      " 2.": 108,
      " 3.": 109,
      " 4.": 110,
      " 5.": 111,
      " 8.": 112,
      " 7.": 113,
      " 9.": 114,
      " 6.": 115,
      " 10.": 116,
      " 11.": 117,
      "d5": 118,
      " 12.": 119,
      " 13.": 120,
      " 14.": 121,
      " 15.": 122,
      " h": 123,
      " 16.": 124,
      " 17.": 125,
      " 18.": 126,
      " 19.": 127,
      "b3": 128,
      "xe5": 129,
      " 20.": 130,
      "e8": 131,
      " 21.": 132,
      " O-O": 133,
      "e1": 134,
      "a4": 135,
      "Nc3": 136,
      " 22.": 137,
      "b4": 138,
      " 23.": 139,
      "h4": 140,
      "d1": 141,
      "c7": 142,
      "d6": 143,
      "c5": 144,
      "d8": 145,
      " 24.": 146,
      " 25.": 147,
      "g2": 148,
      "h3": 149,
      "xe4": 150,
      " 26.": 151,
      "c8": 152,
      "f8": 153,
      " 27.": 154,
      "Ra": 155,
      "f7": 156,
      "f2": 157,
      " 28.": 158,
      "c2": 159,
      " Ra": 160,
      " 29.": 161,
      " Nc6": 162,
      "b6": 163,
      " c5": 164,
      " 30.": 165,
      "c1": 166,
      "xa": 167,
      "b5": 168,
      "f1": 169,
      "h5": 170,
      " 31.": 171,
      " d5": 172,
      " 32.": 173,
      " 33.": 174,
      "xf6": 175,
      " e6": 176,
      " 6": 177,
      "b7": 178,
      " 34.": 179,
      "Kh": 180,
      " e5": 181,
      " 35.": 182,
      " g6": 183,
      "xc4": 184,
      "a3": 185,
      "b8": 186,
      "xc5": 187,
      "xc3": 188,
      " d6": 189,
      " 36.": 190,
      "b1": 191,
      " 37.": 192,
      "a5": 193,
      "h6": 194,
      "xc6": 195,
      " Be7": 196,
      "xf5": 197,
      "Be3": 198,
      " 38.": 199,
      " a6": 200,
      " 39.": 201,
      " e": 202,
      "Bd3": 203,
      "xf3": 204,
      " Bg7": 205,
      " 40.": 206,
      "b2": 207,
      "xf4": 208,
      " b5": 209,
      "g8": 210,
      " h6": 211,
      "xb5": 212,
      " 41.": 213,
      " f5": 214,
      "xe6": 215,
      "xd6": 216,
      "Be2": 217,
      " Qc7": 218,
      "g1": 219,
      " 42.": 220,
      " c6": 221,
      "Re1": 222,
      "Bg5": 223,
      " a5": 224,
      " Re8": 225,
      " cxd4": 226,
      "xg5": 227,
      " 43.": 228,
      "xb4": 229,
      "h7": 230,
      "Qd2": 231,
      " b6": 232,
      " Nd7": 233,
      "a6": 234,
      " Bd7": 235,
      " 44.": 236,
      "Qe2": 237,
      "Rf": 238,
      "xg4": 239,
      "Bg2": 240,
      " h5": 241,
      " 45.": 242,
      "Nxd4": 243,
      " Rc8": 244,
      "xd3": 245,
      " Rf": 246,
      " Bb7": 247,
      "Rx": 248,
      " Be6": 249,
      " Nb": 250,
      "xe3": 251,
      "Qc2": 252,
      " 46.": 253,
      " f": 254,
      " g5": 255,
      "h8": 256,
      " 47.": 257,
      "Nd2": 258,
      " f6": 259,
      "xe7": 260,
      "xg6": 261,
      "Rc1": 262,
      "Kg2": 263,
      " Nbd7": 264,
      " Qe7": 265,
      "Rd1": 266,
      "Bd2": 267,
      "Bf4": 268,
      "Bc4": 269,
      "Kf2": 270,
      " 48.": 271,
      "xd7": 272,
      " Rd8": 273,
      " Rb8": 274,
      " Rx": 275,
      " g": 276,
      " 49.": 277,
      " 7": 278,
      "xb3": 279,
      " Bd6": 280,
      " Qb6": 281,
      "cxd5": 282,
      " Qd7": 283,
      " Bg4": 284,
      " 50.": 285,
      "Ne5": 286,
      "xb6": 287,
      "xd2": 288,
      "h2": 289,
      "Bx": 290,
      "Kh1": 291,
      "Ne2": 292,
      "xd8": 293,
      "exd5": 294,
      "+[": 295,
      " 51.": 296,
      "Kx": 297,
      " Bf5": 298,
      "Bb5": 299,
      "Ke2": 300,
      " Ne7": 301,
      "Rb1": 302,
      " Ne5": 303,
      " Bb4": 304,
      " Bx": 305,
      " Kg7": 306,
      " Ne4": 307,
      "Nd5": 308,
      " 52.": 309,
      "xe2": 310,
      "Kf1": 311,
      "Ne4": 312,
      " Nd5": 313,
      "Nb": 314,
      "Qd3": 315,
      "Kh2": 316,
      " Kf7": 317,
      "Qx": 318,
      " Qa5": 319,
      "xd1": 320,
      " Nc5": 321,
      " 53.": 322,
      "Ke3": 323,
      "Qb3": 324,
      "xb2": 325,
      "xb7": 326,
      "Bb2": 327,
      "Qf3": 328,
      " Nb6": 329,
      " Bc5": 330,
      "Kf3": 331,
      " Nxd5": 332,
      " exd5": 333,
      " b4": 334,
      " 54.": 335,
      "Rad1": 336,
      " Ke7": 337,
      "Nd4": 338,
      "dxe5": 339,
      "Bxf6": 340,
      " Bf6": 341,
      "h1": 342,
      "xa5": 343,
      "Nbd2": 344,
      "xg3": 345,
      " 55.": 346,
      "xa6": 347,
      "Bb3": 348,
      "Qe3": 349,
      "Kg1": 350,
      "Nb3": 351,
      " Nd4": 352,
      "a7": 353,
      " 56.": 354,
      "Nxe4": 355,
      "Bf3": 356,
      "Rd2": 357,
      "xc8": 358,
      "Ng5": 359,
      " Rf8": 360,
      " Kf8": 361,
      "Ne3": 362,
      " Qf6": 363,
      "Nc4": 364,
      "Kd2": 365,
      "Kd3": 366,
      "Rf1": 367,
      "Ng3": 368,
      " Nxe5": 369,
      " Bc6": 370,
      "Kg3": 371,
      "O-O-O": 372,
      "bxc3": 373,
      " dxe4": 374,
      " exd4": 375,
      " Qd8": 376,
      " dxe5": 377,
      " e4": 378,
      " 57.": 379,
      " Nxe4": 380,
      " Qd6": 381,
      "xc2": 382,
      " a4": 383,
      " Bf8": 384,
      " Qx": 385,
      "xc7": 386,
      "xe8": 387,
      "Nxe5": 388,
      " Kf6": 389,
      " Ng4": 390,
      " c4": 391,
      "Nx": 392,
      " Ne6": 393,
      " Rd7": 394,
      " dxc4": 395,
      "xc1": 396,
      " 58.": 397,
      " f4": 398,
      "Rfd1": 399,
      "cxd4": 400,
      "Re2": 401,
      " Rad8": 402,
      " Bxc3": 403,
      "dxc5": 404,
      " Rac8": 405,
      " Ng6": 406,
      "Nd3": 407,
      "a2": 408,
      "Bc2": 409,
      "Kg7": 410,
      " Bxf3": 411,
      " Rg8": 412,
      " Nh5": 413,
      "Rac1": 414,
      " d4": 415,
      "xa3": 416,
      " Nf5": 417,
      "Rfe1": 418,
      "Nb5": 419,
      "xe1": 420,
      " Ke6": 421,
      " Kh8": 422,
      " Nxd4": 423,
      " 59.": 424,
      " Rc7": 425,
      "Ng": 426,
      "Nf4": 427,
      " Ra8": 428,
      " Nc4": 429,
      " h4": 430,
      " Ng": 431,
      "Bf1": 432,
      "xa2": 433,
      " cxd5": 434,
      " Re7": 435,
      "Qg3": 436,
      "xa7": 437,
      " Kx": 438,
      "Kh8": 439,
      "a8": 440,
      " Na5": 441,
      "Bxc4": 442,
      "Nxd5": 443,
      " Ba6": 444,
      " Rfd8": 445,
      "Bg3": 446,
      " Ne8": 447,
      " 60.": 448,
      "Qf2": 449,
      "Qg4": 450,
      "Re3": 451,
      " Nb4": 452,
      "Rc2": 453,
      "Kg8": 454,
      "Rg1": 455,
      "Bd4": 456,
      " Rfe8": 457,
      "fxe5": 458,
      " Nx": 459,
      "Bc3": 460,
      " Kd7": 461,
      "Rd3": 462,
      " Kh7": 463,
      "Nf5": 464,
      "Kf8": 465,
      "Rd": 466,
      " Rf7": 467,
      " Qc6": 468,
      "Ra1": 469,
      "Rh": 470,
      " g4": 471,
      " bxc6": 472,
      "Qc3": 473,
      "Bh4": 474,
      "Rf2": 475,
      "Bxc6": 476,
      " Na6": 477,
      " Qe6": 478,
      " Nf4": 479,
      " Nd6": 480,
      "Nxc6": 481,
      "Ke4": 482,
      "Qa4": 483,
      " Kd6": 484,
      "Kb1": 485,
      "Nc5": 486,
      " Qe8": 487,
      "Bxe4": 488,
      " Qc8": 489,
      " 61.": 490,
      " Bg6": 491,
      " Nc7": 492,
      "Na4": 493,
      "Rf3": 494,
      "Be4": 495,
      "Qxd4": 496,
      "a1": 497,
      " Bxd5": 498,
      " Bc8": 499,
      "Kc2": 500,
      "Re": 501,
      "Kf7": 502,
      "Qd4": 503,
      "Kf4": 504,
      " 8": 505,
      "Qd1": 506,
      " axb5": 507,
      "Rc7": 508,
      " Nf8": 509,
      "Kh7": 510,
      "Qf4": 511,
      "exf5": 512,
      " Bxe5": 513,
      "Qe1": 514,
      "Ke7": 515,
      "Bxd4": 516,
      " Qc5": 517,
      "Qh5": 518,
      "Rd7": 519,
      " Qxd5": 520,
      " O-O-O": 521,
      " Nxc3": 522,
      " 62.": 523,
      "Kd4": 524,
      " Nf": 525,
      " Bd4": 526,
      " Kg6": 527,
      "Qe4": 528,
      "Bxd5": 529,
      "Bf2": 530,
      " Be5": 531,
      " Qg5": 532,
      " Bd5": 533,
      "Nh4": 534,
      "Kc3": 535,
      "Rxd8": 536,
      " Kg8": 537,
      " exf4": 538,
      "gx": 539,
      " fxe4": 540,
      " Qb7": 541,
      " Re": 542,
      "Nxf6": 543,
      "Nf1": 544,
      " Rd": 545,
      "xa8": 546,
      "axb5": 547,
      " Rc2": 548,
      "Nd6": 549,
      " 63.": 550,
      "Kf6": 551,
      " Bb6": 552,
      " Qf7": 553,
      "axb4": 554,
      "Qh4": 555,
      "Bd5": 556,
      "Bh6": 557,
      "exf6": 558,
      " Rh": 559,
      "Ke1": 560,
      " Re6": 561,
      "Rae1": 562,
      "Ra7": 563,
      " Qe5": 564,
      " Qd5": 565,
      " Qg6": 566,
      " Rd2": 567,
      " Qh4": 568,
      "Nge2": 569,
      "Nc2": 570,
      "Bc1": 571,
      " Bxd4": 572,
      "Bxe5": 573,
      " gx": 574,
      " gxf5": 575,
      "Ne1": 576,
      " Qf5": 577,
      " Bh6": 578,
      "Ba4": 579,
      " Bxe4": 580,
      " 64.": 581,
      "Nd": 582,
      " fxe6": 583,
      "Rc3": 584,
      " Rh8": 585,
      " Ra7": 586,
      "Rc": 587,
      " Rf6": 588,
      " Rc": 589,
      " axb4": 590,
      "Qc1": 591,
      " Bxc5": 592,
      "Rb7": 593,
      "Ba3": 594,
      "Na3": 595,
      " Rd6": 596,
      "Bxe7": 597,
      "Qc4": 598,
      " Ra2": 599,
      " Bxf6": 600,
      "Bxg7": 601,
      " Bg5": 602,
      "Kg4": 603,
      "Kg6": 604,
      "Rg3": 605,
      "Rd6": 606,
      "Re7": 607,
      "xa1": 608,
      "Kh3": 609,
      " Rc6": 610,
      " Rb2": 611,
      "Rd4": 612,
      " Nd3": 613,
      " 65.": 614,
      " Rae8": 615,
      "Be5": 616,
      " Be8": 617,
      " Qb8": 618,
      "Rh1": 619,
      " Be4": 620,
      " Rfc8": 621,
      " Kc7": 622,
      " Bb5": 623,
      "exd4": 624,
      "Qxd3": 625,
      "Ke6": 626,
      " Rc4": 627,
      "Nc6": 628,
      " Nge7": 629,
      " Ke5": 630,
      " Bd8": 631,
      " hxg5": 632,
      " Rb7": 633,
      "hxg4": 634,
      " Rb": 635,
      "Ke5": 636,
      "Qg5": 637,
      " Bh5": 638,
      " Qh5": 639,
      "Rd8": 640,
      "Qxe4": 641,
      " gxf6": 642,
      "Bh3": 643,
      "hxg5": 644,
      "Ng4": 645,
      "Kf5": 646,
      "Qxd5": 647,
      "Rb3": 648,
      "Rxe8": 649,
      "Kd7": 650,
      "Kc4": 651,
      " Qb4": 652,
      "Rb": 653,
      "Rxd5": 654,
      "Bxf4": 655,
      " 66.": 656,
      "36.": 657,
      " Bc7": 658,
      " Rxd1": 659,
      "35.": 660,
      "37.": 661,
      "Bxc5": 662,
      "34.": 663,
      "38.": 664,
      " Rc5": 665,
      "39.": 666,
      " Qd4": 667,
      "Rab1": 668,
      "Bc5": 669,
      "33.": 670,
      "Nxe6": 671,
      " Rd5": 672,
      "40.": 673,
      " Ra1": 674,
      " Ra3": 675,
      "Ra8": 676,
      " Re2": 677,
      "Qxf3": 678,
      "32.": 679,
      "Ra2": 680,
      "Kd1": 681,
      "gxf3": 682,
      "Rc6": 683,
      " bxc4": 684,
      " Kf5": 685,
      "Ra3": 686,
      "Qd5": 687,
      " Kc6": 688,
      "Qe5": 689,
      "31.": 690,
      " Rb6": 691,
      "Bxe6": 692,
      "Kd6": 693,
      " Bxf5": 694,
      "gxf4": 695,
      " Rab8": 696,
      " Nfd7": 697,
      " Kxg7": 698,
      "cxb5": 699,
      " Qxd4": 700,
      " Qxe5": 701,
      "Re4": 702,
      "Rh3": 703,
      "Nd1": 704,
      "Kg5": 705,
      "xb8": 706,
      "Qb2": 707,
      "41.": 708,
      "Ra6": 709,
      " Rd4": 710,
      "Bxd6": 711,
      "Rxd4": 712,
      "Kd5": 713,
      " Bxd3": 714,
      "gxf5": 715,
      "30.": 716,
      " hxg4": 717,
      " Qxd6": 718,
      "Rc8": 719,
      " Rb4": 720,
      " 67.": 721,
      " Rd3": 722,
      "Bxf3": 723,
      " hxg6": 724,
      " Rd1": 725,
      " bxc5": 726,
      " Rc3": 727,
      " Bc4": 728,
      " Qe4": 729,
      "Rd5": 730,
      "axb3": 731,
      "Rc5": 732,
      "Rxe5": 733,
      "Rb6": 734,
      "Qh3": 735,
      "Rxd6": 736,
      " Nh6": 737,
      "Rfc1": 738,
      " Rc1": 739,
      "Nc": 740,
      "Bd1": 741,
      "29.": 742,
      "Bg4": 743,
      " Kd5": 744,
      "Rb2": 745,
      "Nf2": 746,
      "Rxf7": 747,
      "Nf6": 748,
      "Rxc8": 749,
      " Ke8": 750,
      "Rc4": 751,
      " Re5": 752,
      "Ne6": 753,
      "Bxf5": 754,
      "#[": 755,
      "Kb2": 756,
      " Ra6": 757,
      "28.": 758,
      "Re5": 759,
      "Ke8": 760,
      "Rb8": 761,
      "42.": 762,
      " Qf4": 763,
      " Nf7": 764,
      " Rg6": 765,
      " d3": 766,
      " Nb8": 767,
      "xa4": 768,
      "fxe4": 769,
      " fxe5": 770,
      " Bxg2": 771,
      "Bd6": 772,
      "Re8": 773,
      "Qxc4": 774,
      "bxc4": 775,
      " 68.": 776,
      "xb1": 777,
      " Re4": 778,
      " e3": 779,
      " a3": 780,
      " Nxc5": 781,
      " Bf7": 782,
      " Rb3": 783,
      " exf5": 784,
      " Ra4": 785,
      "27.": 786,
      "Rxe4": 787,
      "Kh6": 788,
      " Ng5": 789,
      "Rf4": 790,
      "hxg6": 791,
      " Rb1": 792,
      "Rxd1": 793,
      " Nxf3": 794,
      "bxc5": 795,
      "Rxe6": 796,
      " Nxe3": 797,
      " Qxe7": 798,
      "Bb4": 799,
      "43.": 800,
      " Qb5": 801,
      "Kxg2": 802,
      " Rf5": 803,
      " Qg4": 804,
      "Be1": 805,
      "Bxd7": 806,
      "Qxf6": 807,
      "Kc5": 808,
      "Kb3": 809,
      "exd6": 810,
      "Rb5": 811,
      "Rxb7": 812,
      "Qb4": 813,
      " Re1": 814,
      " Rxb2": 815,
      "26.": 816,
      "Rf7": 817,
      "Ra5": 818,
      "Bd7": 819,
      " Bxe3": 820,
      " Qc4": 821,
      "Qf5": 822,
      "fxe3": 823,
      "hxg3": 824,
      "Qxe5": 825,
      " Rxd4": 826,
      "Nxc5": 827,
      "44.": 828,
      "Nh3": 829,
      " Qa6": 830,
      " dxc5": 831,
      " 69.": 832,
      "Nxd7": 833,
      " Nd": 834,
      " Qxc5": 835,
      "Bb1": 836,
      " Rxd5": 837,
      " Nxd3": 838,
      "Nxc4": 839,
      " Rg7": 840,
      "Ra4": 841,
      " Bxc4": 842,
      "Kc6": 843,
      " Nc": 844,
      "Qxd8": 845,
      "25.": 846,
      " Ra5": 847,
      " Ne3": 848,
      "Kc7": 849,
      "Nxd6": 850,
      "45.": 851,
      "Kc1": 852,
      " Bxc6": 853,
      " Nd8": 854,
      " Rxc3": 855,
      "Qh6": 856,
      "Qb5": 857,
      " Rxe5": 858,
      " Nxc4": 859,
      " b3": 860,
      " Rxc4": 861,
      " Qxf6": 862,
      "Bf5": 863,
      " Rxe1": 864,
      " Rxe4": 865,
      "Rxd7": 866,
      " c3": 867,
      "Rg2": 868,
      "Re6": 869,
      " Rxc1": 870,
      "Rb4": 871,
      " Qf8": 872,
      "46.": 873,
      "Qxc3": 874,
      "Nf": 875,
      "24.": 876,
      "Nxf5": 877,
      " Rxa2": 878,
      " Nc3": 879,
      "dxe6": 880,
      " gxf4": 881,
      "Qc5": 882,
      " Bd3": 883,
      " 70.": 884,
      "Kd8": 885,
      " f3": 886,
      "Rxe7": 887,
      "Qd6": 888,
      " Bf4": 889,
      "Qf6": 890,
      " Nxf6": 891,
      "Qa3": 892,
      "dxe4": 893,
      "Qg2": 894,
      " Rb5": 895,
      " Qg7": 896,
      "Rxc6": 897,
      "47.": 898,
      "Rxf6": 899,
      " Qxb2": 900,
      " Bxe2": 901,
      "Qb1": 902,
      "dxc6": 903,
      "Rxa7": 904,
      "Qxd6": 905,
      " Nh7": 906,
      "23.": 907,
      "Bc6": 908,
      "Rxf8": 909,
      " Nc8": 910,
      " Rf4": 911,
      "Qe6": 912,
      "Be6": 913,
      "Qe7": 914,
      "Nc1": 915,
      "Bxb7": 916,
      " axb6": 917,
      " Bh3": 918,
      "Rg7": 919,
      " Kg5": 920,
      " Kb8": 921,
      "Rxc5": 922,
      "Nh2": 923,
      "48.": 924,
      "Qxe6": 925,
      "Rh7": 926,
      "Qd7": 927,
      " Nxf4": 928,
      " Bxf4": 929,
      " Kc5": 930,
      "Qxe3": 931,
      " Qa7": 932,
      "Qc7": 933,
      " Re3": 934,
      " Bxb2": 935,
      " Qxe4": 936,
      "Rh8": 937,
      "22.": 938,
      " 71.": 939,
      " h3": 940,
      " Qh6": 941,
      "Bxb5": 942,
      "Nxb5": 943,
      " Rxc2": 944,
      " Ngf6": 945,
      " Rh6": 946,
      " Qe3": 947,
      " Rf2": 948,
      "Bb6": 949,
      "Rf8": 950,
      " Bxg5": 951,
      "Bxg5": 952,
      "49.": 953,
      " Bc3": 954,
      "Rh4": 955,
      "Rf6": 956,
      " Ne": 957,
      " Kd8": 958,
      " Ng7": 959,
      "gxf6": 960,
      " 9": 961,
      "Nb6": 962,
      " cxb4": 963,
      " Bxd2": 964,
      " Rxd8": 965,
      "21.": 966,
      "Kb4": 967,
      "Qxb7": 968,
      " Rh1": 969,
      "Rxf5": 970,
      "fxg5": 971,
      " Nb5": 972,
      " Qa4": 973,
      "fxg6": 974,
      "Qxe2": 975,
      "Nb4": 976,
      "Nxe7": 977,
      "bxc6": 978,
      "Qxe7": 979,
      "50.": 980,
      "Kh4": 981,
      " Qxc3": 982,
      "Bxa6": 983,
      "Rg4": 984,
      " Nf3": 985,
      "Rhe1": 986,
      "Rxc7": 987,
      " Rh2": 988,
      "Qf1": 989,
      "Rf5": 990,
      " Rxf2": 991,
      " Qd3": 992,
      "Qc6": 993,
      " 72.": 994,
      "Qxf5": 995,
      "Qxd7": 996,
      "Qxd2": 997,
      " Qc2": 998,
      "Bxc3": 999,
      "Rxa6": 1000,
      "Rxc4": 1001,
      " Ng8": 1002,
      "Nb1": 1003,
      " Qd2": 1004,
      "Kb6": 1005,
      " Rxe3": 1006,
      "Bxf7": 1007,
      " bxc3": 1008,
      "Nh5": 1009,
      "20.": 1010,
      "Rg8": 1011,
      "Rxd3": 1012,
      "51.": 1013,
      " Bxb5": 1014,
      " Rxf4": 1015,
      "Bxg6": 1016,
      "Rxc1": 1017,
      "Nxg6": 1018,
      "Qxc5": 1019,
      " Rg4": 1020,
      " fxg4": 1021,
      " Nxb3": 1022,
      "Nd7": 1023,
      " fxg6": 1024,
      "Ne": 1025,
      " Be3": 1026,
      "Rxf4": 1027,
      "Kb5": 1028,
      "Rg5": 1029,
      " Rxc5": 1030,
      " Rh5": 1031,
      "Qxc6": 1032,
      "R1": 1033,
      " Rxd6": 1034,
      "Rh2": 1035,
      " Qc3": 1036,
      "Nc7": 1037,
      " Rxd2": 1038,
      " Ba5": 1039,
      " Rxf3": 1040,
      "Nxg5": 1041,
      " Na4": 1042,
      " Rxd3": 1043,
      " Bxg4": 1044,
      "Ne7": 1045,
      "Rxc3": 1046,
      "Qxf7": 1047,
      "Na5": 1048,
      " Qxc4": 1049,
      " Rf1": 1050,
      " Rg5": 1051,
      " Rh7": 1052,
      "52.": 1053,
      "Bf6": 1054,
      "Qxf4": 1055,
      " Qe2": 1056,
      "19.": 1057,
      "Rxd2": 1058,
      " 73.": 1059,
      "Rh6": 1060,
      " Rg2": 1061,
      "Bxh6": 1062,
      " Qxc6": 1063,
      " bxa4": 1064,
      " Rf3": 1065,
      " Bh4": 1066,
      " Kb7": 1067,
      " Nxd2": 1068,
      "Qg6": 1069,
      "Qd8": 1070,
      "Qf7": 1071,
      "Rxg7": 1072,
      " Ke4": 1073,
      " Qxf4": 1074,
      " Rg1": 1075,
      " dxc3": 1076,
      " Kh6": 1077,
      " Qxa2": 1078,
      "Nxf7": 1079,
      "Be7": 1080,
      " gxh5": 1081,
      "Rxe1": 1082,
      " Bxe6": 1083,
      "53.": 1084,
      " Rxf5": 1085,
      "Rxe3": 1086,
      "Ba2": 1087,
      " Rh4": 1088,
      "Nxf4": 1089,
      " exf3": 1090,
      " g3": 1091,
      " Rxe2": 1092,
      " Bxd6": 1093,
      " Kd4": 1094,
      "Qa5": 1095,
      " Rxf1": 1096,
      " Kf4": 1097,
      " Nxg3": 1098,
      "Rxa5": 1099,
      "18.": 1100,
      "Kh5": 1101,
      " Kb6": 1102,
      " Rh3": 1103,
      "Red1": 1104,
      " Ba4": 1105,
      "Rh5": 1106,
      "Ngf3": 1107,
      "fxe6": 1108,
      "Rg6": 1109,
      " Qxd7": 1110,
      " Qxf3": 1111,
      " Qxd2": 1112,
      " Rxc8": 1113,
      " Rxb3": 1114,
      "cxb4": 1115,
      " Qa3": 1116,
      "Qxh6": 1117,
      "gxh5": 1118,
      " 74.": 1119,
      " cxb5": 1120,
      "Qxg6": 1121,
      "Qe8": 1122,
      " Nxg4": 1123,
      "Bxf8": 1124,
      " Qh3": 1125,
      "Nxc3": 1126,
      " Qe1": 1127,
      "54.": 1128,
      " Qa8": 1129,
      "Qb7": 1130,
      "Rxh7": 1131,
      " Rxa4": 1132,
      " Qd1": 1133,
      " Qxd1": 1134,
      "Qxg4": 1135,
      "Rxf3": 1136,
      " Nh4": 1137,
      " Qf3": 1138,
      " Qb2": 1139,
      "Qxg5": 1140,
      " Qc1": 1141,
      " cxd6": 1142,
      "17.": 1143,
      "Kb8": 1144,
      "Rxb6": 1145,
      " Rxg2": 1146,
      "Qb6": 1147,
      " Bxb4": 1148,
      "Kxf2": 1149,
      " Rxc6": 1150,
      "Bc7": 1151,
      "Qc8": 1152,
      " Qxg5": 1153,
      "axb6": 1154,
      "Qxb6": 1155,
      "Bh5": 1156,
      " Nb7": 1157,
      " Nb3": 1158,
      "fxg4": 1159,
      "Rxg6": 1160,
      "Nxf3": 1161,
      "55.": 1162,
      " Rxe6": 1163,
      "Kb7": 1164,
      " axb3": 1165,
      "Qxa7": 1166,
      " Rxd7": 1167,
      " Rg3": 1168,
      " Qxe6": 1169,
      " Rxa3": 1170,
      "Bxg4": 1171,
      " R8": 1172,
      "16.": 1173,
      "Bxb6": 1174,
      " Qxe3": 1175,
      "Kc8": 1176,
      " Rxb4": 1177,
      "Rxb5": 1178,
      " 75.": 1179,
      "bxa5": 1180,
      " Rxf6": 1181,
      "cxd6": 1182,
      " Ne2": 1183,
      " Nxf5": 1184,
      "Ba5": 1185,
      "Ng2": 1186,
      "Qa2": 1187,
      "Qxb5": 1188,
      "cxd3": 1189,
      " Red8": 1190,
      "56.": 1191,
      " Nxb4": 1192,
      "15.": 1193,
      " hxg3": 1194,
      "Bxb4": 1195,
      "Qxg7": 1196,
      " Bxf2": 1197,
      " Bb3": 1198,
      "Rde1": 1199,
      " Qxb3": 1200,
      " fxg3": 1201,
      "Rxe2": 1202,
      "Kxf7": 1203,
      "Rxb4": 1204,
      " Bf3": 1205,
      " Bxh3": 1206,
      " Qb1": 1207,
      " Kc4": 1208,
      "14.": 1209,
      " Nc2": 1210,
      " Qf2": 1211,
      " Qa1": 1212,
      "Ba6": 1213,
      " Qxb4": 1214,
      "Qxb4": 1215,
      "Qb8": 1216,
      " Qxf2": 1217,
      " gxh4": 1218,
      "Ng6": 1219,
      "Nxb6": 1220,
      " Bc2": 1221,
      "Rcd1": 1222,
      "Rg": 1223,
      "Rxa4": 1224,
      " Qxf5": 1225,
      "57.": 1226,
      "12.": 1227,
      "Ng1": 1228,
      " Qg3": 1229,
      " fxg5": 1230,
      " Kc8": 1231,
      " Kg4": 1232,
      "13.": 1233,
      " 76.": 1234,
      " Bxg3": 1235,
      " Nd2": 1236,
      " Rxe7": 1237,
      "Ka2": 1238,
      " Rxh2": 1239,
      " Bxb3": 1240,
      " Qb3": 1241,
      "Qxa6": 1242,
      " Nxe2": 1243,
      "Qxh5": 1244,
      "Rxh6": 1245,
      "Rxh5": 1246,
      "Rxa8": 1247,
      "Nf7": 1248,
      "Kxf1": 1249,
      "fxg3": 1250,
      "Qa6": 1251,
      " Nxc6": 1252,
      "Bxd3": 1253,
      " Rg": 1254,
      "11.": 1255,
      "Bg6": 1256,
      " Rxb5": 1257,
      " dxc6": 1258,
      " Bxf1": 1259,
      "Nb2": 1260,
      " Qxc2": 1261,
      "58.": 1262,
      " Rxg3": 1263,
      "exf4": 1264,
      " Rfb8": 1265,
      " Ba7": 1266,
      " Ba3": 1267,
      "Bh2": 1268,
      "Qh8": 1269,
      " Rxa5": 1270,
      " Qxd3": 1271,
      "gxh4": 1272,
      " Rcd8": 1273,
      "Qh7": 1274,
      " Qxe2": 1275,
      "Qxc7": 1276,
      " 77.": 1277,
      "Ndb5": 1278,
      " Qxb5": 1279,
      " a2": 1280,
      "10.": 1281,
      " Ng3": 1282,
      "bxa4": 1283,
      " Rhe8": 1284,
      "Bxd8": 1285,
      " d2": 1286,
      " Qxg3": 1287,
      "Qa8": 1288,
      " Be2": 1289,
      " Rxc7": 1290,
      " Bb8": 1291,
      "Qg7": 1292,
      "59.": 1293,
      " Bd2": 1294,
      "Qf8": 1295,
      " Bh7": 1296,
      " Kb5": 1297,
      " Rxh4": 1298,
      "Ka1": 1299,
      "Rxc2": 1300,
      "Rxf2": 1301,
      "Bxh7": 1302,
      "Qa7": 1303,
      "Rxf1": 1304,
      " c2": 1305,
      " Nxd7": 1306,
      " Qxg4": 1307,
      " cxb3": 1308,
      "Qxh7": 1309,
      "Nce2": 1310,
      "Rxg5": 1311,
      " bxa5": 1312,
      " Rxb7": 1313,
      " Nxf2": 1314,
      " Qxh4": 1315,
      "dxc4": 1316,
      " Rxh3": 1317,
      " Bxa3": 1318,
      "Raf1": 1319,
      " Ba8": 1320,
      " Raf8": 1321,
      " Ndf6": 1322,
      "Rhd1": 1323,
      " Rxa1": 1324,
      " 78.": 1325,
      "Na2": 1326,
      " Bxa4": 1327,
      "Nxb7": 1328,
      " Qxb6": 1329,
      "60.": 1330,
      "Bxc8": 1331,
      "Bf7": 1332,
      "cxb6": 1333,
      "Qxa5": 1334,
      " b2": 1335,
      "Kxd2": 1336,
      "Qa1": 1337,
      " Qxa4": 1338,
      "Qxe8": 1339,
      " Rde8": 1340,
      " Rxa8": 1341,
      "Nxd2": 1342,
      "Bb7": 1343,
      "Rfb1": 1344,
      " Nxg5": 1345,
      "Kxf3": 1346,
      " Qh1": 1347,
      "Bf8": 1348,
      "Rxa1": 1349,
      "Kxg7": 1350,
      " Bb2": 1351,
      "Bxd2": 1352,
      "Bxe3": 1353,
      "Rxb2": 1354,
      " Nxb2": 1355,
      " Rxg4": 1356,
      "Nxc8": 1357,
      " Qxh3": 1358,
      " Na7": 1359,
      " Nxd6": 1360,
      " e2": 1361,
      "Bxa7": 1362,
      " Nf2": 1363,
      " Bxh4": 1364,
      " Qxa3": 1365,
      " 79.": 1366,
      "Rxb8": 1367,
      " Qa2": 1368,
      " Nbc6": 1369,
      " Qxb7": 1370,
      " Rxe8": 1371,
      " Qf1": 1372,
      " Rxa6": 1373,
      " Bg3": 1374,
      "Ka3": 1375,
      "61.": 1376,
      " Kxf7": 1377,
      "Nxc7": 1378,
      "Nxg4": 1379,
      " Nxe6": 1380,
      "Nxb4": 1381,
      " Bf2": 1382,
      " Rxb6": 1383,
      " Nxa4": 1384,
      "Kxe2": 1385,
      "Qh2": 1386,
      " Bxc2": 1387,
      "Nxg7": 1388,
      " Kf3": 1389,
      " Kb4": 1390,
      " Bxd7": 1391,
      "Ndf3": 1392,
      "N1": 1393,
      "Qg8": 1394,
      "Bxh5": 1395,
      "Bg1": 1396,
      " Nxb5": 1397,
      "Bxc7": 1398,
      "Nh6": 1399,
      " 10": 1400,
      "Nxa5": 1401,
      " Qxg2": 1402,
      " Ke3": 1403,
      " 80.": 1404,
      "Rhg1": 1405,
      " Nxb6": 1406,
      " Rbc8": 1407,
      "bxa6": 1408,
      " Kh5": 1409,
      " Rhd8": 1410,
      "Kxd8": 1411,
      " gxf3": 1412,
      "Rxg4": 1413,
      " Kd3": 1414,
      "Qxc2": 1415,
      "gxh6": 1416,
      " Rxg5": 1417,
      " Bxa2": 1418,
      "Rhf1": 1419,
      "62.": 1420,
      " Bxh6": 1421,
      " Rec8": 1422,
      "Bg7": 1423,
      "Nxe2": 1424,
      " Rxf7": 1425,
      "Qxb3": 1426,
      " Nxc2": 1427,
      "Nxe3": 1428,
      " Nxe7": 1429,
      "Kxf6": 1430,
      " Kg3": 1431,
      " Rxb1": 1432,
      " Qh2": 1433,
      " exf6": 1434,
      " Qxa5": 1435,
      "Kxf4": 1436,
      "Bxa5": 1437,
      "Rxb3": 1438,
      " Kc3": 1439,
      "Rxb1": 1440,
      "Qxb2": 1441,
      "Nxa4": 1442,
      "Ka4": 1443,
      " Qg1": 1444,
      "Kxe3": 1445,
      "Rxa3": 1446,
      " h2": 1447,
      "Be8": 1448,
      "Rbc1": 1449,
      "63.": 1450,
      "Qxc8": 1451,
      " Qxc7": 1452,
      " Nxh5": 1453,
      "Rbd1": 1454,
      "Qxd1": 1455,
      " Rbd8": 1456,
      " 81.": 1457,
      "cxb3": 1458,
      " bxa3": 1459,
      "Nxd8": 1460,
      "Nfd2": 1461,
      "Qxa4": 1462,
      "Ka6": 1463,
      " dxe3": 1464,
      " Rxb8": 1465,
      "Kxg3": 1466,
      "bxa3": 1467,
      "Nde2": 1468,
      "Nxf8": 1469,
      "Rec1": 1470,
      "Kxd1": 1471,
      "Ka7": 1472,
      " Nh": 1473,
      " f2": 1474,
      " Rxa7": 1475,
      "xf7": 1476,
      " Rhg8": 1477,
      "Ka5": 1478,
      "Kxh7": 1479,
      "xg7": 1480,
      "Bd8": 1481,
      "gxh3": 1482,
      " cxd3": 1483,
      "Kxg4": 1484,
      "Qxf8": 1485,
      "Rdc1": 1486,
      " gxh6": 1487,
      " exd6": 1488,
      " Rxf8": 1489,
      "64.": 1490,
      "Nxd3": 1491,
      " Bxh2": 1492,
      " Kxf8": 1493,
      "Kxe4": 1494,
      "Bxa8": 1495,
      "Nxh5": 1496,
      " Rxh5": 1497,
      "Qg1": 1498,
      "Rxh4": 1499,
      " exd3": 1500,
      "Nxe8": 1501,
      " Rdc8": 1502,
      "Kxf5": 1503,
      "Kxf8": 1504,
      " Kxe7": 1505,
      " Qg2": 1506,
      " Be1": 1507,
      "Kxg5": 1508,
      " 82.": 1509,
      "Bc8": 1510,
      " Qh7": 1511,
      " Bc1": 1512,
      "Bxe8": 1513,
      "Bxe2": 1514,
      " Bxc1": 1515,
      " Nce7": 1516,
      "Qxe1": 1517,
      "Qxc1": 1518,
      " Qxh2": 1519,
      "Nxa7": 1520,
      "65.": 1521,
      " Nh3": 1522,
      " Qg8": 1523,
      "Nxb3": 1524,
      "Ba1": 1525,
      " Kb3": 1526,
      "Nxh6": 1527,
      " Rhf8": 1528,
      " N8": 1529,
      "Kxh2": 1530,
      "Kxg6": 1531,
      " bxa6": 1532,
      " Na": 1533,
      " Bh8": 1534,
      " 83.": 1535,
      " N7": 1536,
      "Nb7": 1537,
      "Rdg1": 1538,
      " Bd1": 1539,
      " Nbd5": 1540,
      " Bxa6": 1541,
      " g2": 1542,
      "66.": 1543,
      " Bxd1": 1544,
      " Nxg2": 1545,
      "Nxh4": 1546,
      " Qxc8": 1547,
      "Nxh7": 1548,
      "Rdf1": 1549,
      "Rxa2": 1550,
      "Kxd3": 1551,
      " Nxa6": 1552,
      "Qxf2": 1553,
      "Kxe5": 1554,
      " Nb2": 1555,
      " Bf1": 1556,
      "Ka8": 1557,
      " Rce8": 1558,
      " Kxf6": 1559,
      " Nxa2": 1560,
      "Rce1": 1561,
      " fxe3": 1562,
      "Rxg8": 1563,
      "Kxd7": 1564,
      "exf7": 1565,
      " 84.": 1566,
      "Nxa6": 1567,
      "Nbc3": 1568,
      "Bxd1": 1569,
      "Qxh4": 1570,
      "67.": 1571,
      " Nxh4": 1572,
      " Nxa5": 1573,
      "Kxh5": 1574,
      "Nxa8": 1575,
      "Rxh8": 1576,
      "Bh7": 1577,
      "Ne8": 1578,
      "Nh": 1579,
      " Bg2": 1580,
      "Kxe7": 1581,
      " Bxa1": 1582,
      "Kxd4": 1583,
      " Ka7": 1584,
      " Kh4": 1585,
      " Bg8": 1586,
      "Bxa4": 1587,
      "68.": 1588,
      " Nxh3": 1589,
      " 85.": 1590,
      " Qxe1": 1591,
      "R5": 1592,
      "Kxh4": 1593,
      "Qxa8": 1594,
      "Na": 1595,
      "Kxe6": 1596,
      " N6": 1597,
      " gxh3": 1598,
      " Rbe8": 1599,
      "Rbe1": 1600,
      "Rxg3": 1601,
      "N2": 1602,
      "Bxc1": 1603,
      " Nxc1": 1604,
      " Kxd7": 1605,
      " Nxf1": 1606,
      "Qxg3": 1607,
      " Rdf8": 1608,
      " Bb1": 1609,
      "Kxh6": 1610,
      "Kxh3": 1611,
      " Kxe6": 1612,
      " Qxh5": 1613,
      " Na3": 1614,
      " Rhc8": 1615,
      " Rdg8": 1616,
      " Qxa8": 1617,
      "fxg7": 1618,
      " Nxa3": 1619,
      "Bg8": 1620,
      "Ba7": 1621,
      "R3": 1622,
      "69.": 1623,
      " 86.": 1624,
      "Kxc4": 1625,
      "R4": 1626,
      "Kxd5": 1627,
      " cxb6": 1628,
      "Nd8": 1629,
      "Bb8": 1630,
      "xg2": 1631,
      "Rdd1": 1632,
      "Bxb8": 1633,
      " Nxd1": 1634,
      " Qxc1": 1635,
      " Rxh1": 1636,
      "Nbd4": 1637,
      " Bg1": 1638,
      "R6": 1639,
      "Kxc3": 1640,
      " Rxh6": 1641,
      "Kxe1": 1642,
      "Nxg3": 1643,
      "Nxd1": 1644,
      "Rxg2": 1645,
      " Nxg6": 1646,
      "Qxf1": 1647,
      "Nf8": 1648,
      "Kxc2": 1649,
      " Rxg6": 1650,
      " R4": 1651,
      " Bxe7": 1652,
      "Qxg2": 1653,
      "70.": 1654,
      " Qh8": 1655,
      " 87.": 1656,
      "Rxh3": 1657,
      " Ka8": 1658,
      " Rxg7": 1659,
      "Bxb3": 1660,
      "Nc8": 1661,
      "Bxh3": 1662,
      "Na6": 1663,
      " Rxg1": 1664,
      "Ree1": 1665,
      "Qxa1": 1666,
      "Kxc5": 1667,
      " Kxe5": 1668,
      "Ng7": 1669,
      "Bxh4": 1670,
      " Bxa5": 1671,
      " Nec6": 1672,
      " Qxd8": 1673,
      " Kxd6": 1674,
      " Rcc8": 1675,
      " Bxe1": 1676,
      " Ka6": 1677,
      "71.": 1678,
      " Bh2": 1679,
      "exf3": 1680,
      " Nfd5": 1681,
      " Ned7": 1682,
      " Na8": 1683,
      " 88.": 1684,
      "Nce4": 1685,
      " Qxf7": 1686,
      " Nde5": 1687,
      "Rhc1": 1688,
      "Kxb2": 1689,
      " Nhf6": 1690,
      " Ne1": 1691,
      "Kxb4": 1692,
      "xf2": 1693,
      " R5": 1694,
      "Qxb8": 1695,
      " Qxa1": 1696,
      " Nge5": 1697,
      " Ree8": 1698,
      " Qxa6": 1699,
      "Nge4": 1700,
      " Qxg6": 1701,
      " Rdd8": 1702,
      "N3": 1703,
      "Bxc2": 1704,
      " a1": 1705,
      " Bxb1": 1706,
      "Bh1": 1707,
      "Qh1": 1708,
      "R7": 1709,
      "Kxd6": 1710,
      " Nxe1": 1711,
      "Rfa1": 1712,
      " Nxh2": 1713,
      " R6": 1714,
      " Kf2": 1715,
      " Kxf5": 1716,
      " Ka5": 1717,
      "72.": 1718,
      "Bxf1": 1719,
      "dxc3": 1720,
      " Bxb6": 1721,
      " Nd1": 1722,
      "Na7": 1723,
      " Qxf1": 1724,
      " 89.": 1725,
      "Kxb5": 1726,
      " Reb8": 1727,
      " Kxg6": 1728,
      " Bxh5": 1729,
      " Kc2": 1730,
      " Rag8": 1731,
      "R8": 1732,
      " N8d7": 1733,
      " Kxd5": 1734,
      " Nc1": 1735,
      " Kxd8": 1736,
      " Ke2": 1737,
      " Kxg5": 1738,
      " Bxc8": 1739,
      "Nfd4": 1740,
      " Kg2": 1741,
      "73.": 1742,
      " b1": 1743,
      "Reb1": 1744,
      " Kh3": 1745,
      " N5": 1746,
      "Nde4": 1747,
      " Rfa8": 1748,
      "Bxg3": 1749,
      " Ba2": 1750,
      " 90.": 1751,
      "Nxg2": 1752,
      " Kd2": 1753,
      "Nbd7": 1754,
      " Kxh7": 1755,
      " Nxg7": 1756,
      " Nxa1": 1757,
      " Nxc7": 1758,
      " Qxe8": 1759,
      "Nh7": 1760,
      " Bxb7": 1761,
      " Raa8": 1762,
      "Nxa3": 1763,
      " Qxg7": 1764,
      " R2": 1765,
      "Kxg1": 1766,
      " Kb2": 1767,
      " R3": 1768,
      "Bxe1": 1769,
      " c1": 1770,
      "Rxh1": 1771,
      " Ncd7": 1772,
      "Rcc1": 1773,
      "N5": 1774,
      "gxf7": 1775,
      "Nec3": 1776,
      "Bxb2": 1777,
      " Kxf4": 1778,
      " Rxh7": 1779,
      "74.": 1780,
      " cxb2": 1781,
      "Rag1": 1782,
      "Kxc6": 1783,
      " Kxh6": 1784,
      " Nce5": 1785,
      "Kxa5": 1786,
      "Nxe1": 1787,
      " Rxh8": 1788,
      " 91.": 1789,
      "Ref1": 1790,
      "R1d2": 1791,
      " Ndxe5": 1792,
      "Kxe8": 1793,
      " Ka4": 1794,
      "Red2": 1795,
      "Qxa3": 1796,
      " Ngxe5": 1797,
      " N7f6": 1798,
      "Qxh8": 1799,
      "Bxa3": 1800,
      " Bxc7": 1801,
      "Nbxd4": 1802,
      " Ng2": 1803,
      " Rff8": 1804,
      " d1": 1805,
      " Nxb7": 1806,
      "Nxc2": 1807,
      "75.": 1808,
      "Nbxd2": 1809,
      "Raa1": 1810,
      "Kxb7": 1811,
      " Nef6": 1812,
      " Qxh6": 1813,
      "Kxg8": 1814,
      "Nfe5": 1815,
      "Nxc1": 1816,
      "dxe7": 1817,
      " Qxf8": 1818,
      " Nxh6": 1819,
      "Qxh3": 1820,
      " Bxd8": 1821,
      " Kxh4": 1822,
      "Rff1": 1823,
      "Kxb3": 1824,
      " Bxa8": 1825,
      " 92.": 1826,
      "Nxb2": 1827,
      " Ref8": 1828,
      " fxg2": 1829,
      " Qxb1": 1830,
      " Nf1": 1831,
      " N6d7": 1832,
      " Nh8": 1833,
      "Kxc7": 1834,
      "Rxg1": 1835,
      "Ncd5": 1836,
      "Nh1": 1837,
      " Rbb8": 1838,
      " Nce4": 1839,
      " exf2": 1840,
      " Nfe4": 1841,
      "Kxb6": 1842,
      "Nxb8": 1843,
      "76.": 1844,
      " Na2": 1845,
      "Rxh2": 1846,
      " Kxc6": 1847,
      "Nce3": 1848,
      " Kxe8": 1849,
      " Kxc5": 1850,
      "N1c3": 1851,
      " h1": 1852,
      " Rcb8": 1853,
      " e1": 1854,
      " Qxb8": 1855,
      " Bxg6": 1856,
      " Kxg4": 1857,
      " 93.": 1858,
      "Qxb1": 1859,
      " R1": 1860,
      "Kxa4": 1861,
      " Nbxd5": 1862,
      "Ned4": 1863,
      "Neg5": 1864,
      "Rdh1": 1865,
      "hxg7": 1866,
      " Kxc7": 1867,
      " Kxh5": 1868,
      "cxb7": 1869,
      "Bxh8": 1870,
      " f1": 1871,
      " Rcf8": 1872,
      " Ka3": 1873,
      "Bxf2": 1874,
      "77.": 1875,
      " Bxf8": 1876,
      " Nfxd5": 1877,
      "Rde2": 1878,
      " 94.": 1879,
      "N4": 1880,
      "Nxh8": 1881,
      "Bxa1": 1882,
      " Kxe4": 1883,
      " Kxc4": 1884,
      "Na1": 1885,
      "Rcd2": 1886,
      " Qxa7": 1887,
      " Rdb8": 1888,
      " Bxg7": 1889,
      "78.": 1890,
      " Rxg8": 1891,
      "Kxa6": 1892,
      " Ndc5": 1893,
      "Rdb1": 1894,
      "Qxg8": 1895,
      " g1": 1896,
      "Rbb1": 1897,
      "Rcf1": 1898,
      "Nb8": 1899,
      " 95.": 1900,
      "gxh7": 1901,
      "Nxh3": 1902,
      "Ng8": 1903,
      "exd3": 1904,
      "Rdd7": 1905,
      " Nxd8": 1906,
      "10": 1907,
      "Ndxe4": 1908,
      " Ncxe5": 1909,
      " Raxc8": 1910,
      " Kxb5": 1911,
      "Kxc1": 1912,
      "exd7": 1913,
      "N2f3": 1914,
      "dxc7": 1915,
      "Nce5": 1916,
      " Rbf8": 1917,
      "Rea1": 1918,
      " Kxd4": 1919,
      "79.": 1920,
      "Rcb1": 1921,
      "Nxf2": 1922,
      "Rdd2": 1923,
      "Qxa2": 1924,
      " Red7": 1925,
      " Kxa4": 1926,
      "R1e2": 1927,
      " Kxb4": 1928,
      " 96.": 1929,
      "Bxg8": 1930,
      " N4": 1931,
      "Rbf1": 1932,
      " axb2": 1933,
      " Rcd7": 1934,
      "Nxf1": 1935,
      " Rfxd8": 1936,
      "R2": 1937,
      "Rdc2": 1938,
      "Ree2": 1939,
      "Raxd1": 1940,
      " Nh2": 1941,
      " hxg2": 1942,
      " Kxg3": 1943,
      " Rhb8": 1944,
      "Kxa3": 1945,
      "Kxh1": 1946,
      "80.": 1947,
      " Kxh3": 1948,
      "Rhb1": 1949,
      " R8d7": 1950,
      " Neg4": 1951,
      "N1h2": 1952,
      "Rcc7": 1953,
      "N1d2": 1954,
      " 97.": 1955,
      "Nfg5": 1956,
      "Nhf3": 1957,
      " Ree7": 1958,
      " dxe6": 1959,
      " Qxh1": 1960,
      "Rfe2": 1961,
      "fxe7": 1962,
      " Kxb7": 1963,
      "Ned2": 1964,
      "Rfd2": 1965,
      " Raxd8": 1966,
      " Rde7": 1967,
      " Nxc8": 1968,
      "Bxg2": 1969,
      " 98.": 1970,
      " Rdd7": 1971,
      " Kxf3": 1972,
      " Rdd2": 1973,
      " Nxf7": 1974,
      " Bxf7": 1975,
      " N7b6": 1976,
      " Kxb6": 1977,
      "Kxa2": 1978,
      " Rdc7": 1979,
      " Ned5": 1980,
      " Rcc7": 1981,
      " Rfe7": 1982,
      "81.": 1983,
      " Bxe8": 1984,
      " Nxb1": 1985,
      " Kh2": 1986,
      " Rea8": 1987,
      "Rge1": 1988,
      " Nb1": 1989,
      "Rfxd1": 1990,
      "Raxc1": 1991,
      "Ree7": 1992,
      "Nfxd4": 1993,
      "Ncb5": 1994,
      " Nde7": 1995,
      " Rgf8": 1996,
      " Bxh1": 1997,
      " 99.": 1998,
      "Ndc4": 1999,
      " Nxf8": 2000,
      " Rcc2": 2001,
      " Nxe8": 2002,
      " Rdh8": 2003,
      " Rge8": 2004,
      "Ned5": 2005,
      " Nfg4": 2006,
      "axb7": 2007,
      " R8c7": 2008,
      "Kxa7": 2009,
      " R7": 2010,
      "Red3": 2011,
      " gxf2": 2012,
      "Ncxe4": 2013,
      "Rgf1": 2014,
      " N5f6": 2015,
      "R1c2": 2016,
      " Qxg1": 2017,
      "Rcc2": 2018,
      "82.": 2019,
      " Kxb3": 2020,
      " Kxa5": 2021,
      " Rff7": 2022,
      " Kxh8": 2023,
      "Ncd2": 2024,
      " 100.": 2025,
      "Rah1": 2026,
      " Kxa3": 2027,
      " Nfxe4": 2028,
      "Rff2": 2029,
      " Kxg8": 2030,
      "Nexd4": 2031,
      "Nxg8": 2032,
      " R8e7": 2033,
      "Nef3": 2034,
      "N1e2": 2035,
      " Rah8": 2036,
      " Ndb4": 2037,
      " gxh2": 2038,
      " Nfe8": 2039,
      "83.": 2040,
      " Bxg1": 2041,
      "Nxb1": 2042,
      " Nxh1": 2043,
      "Nxa2": 2044,
      " Ree2": 2045,
      " Nac5": 2046,
      " Ncd4": 2047,
      "Rgd1": 2048,
      "Ree3": 2049,
      " Rgd8": 2050,
      " Kxc3": 2051,
      " 101.": 2052,
      " Ka2": 2053,
      " dxc2": 2054,
      "Rec2": 2055,
      "Bxb1": 2056,
      " Nhf4": 2057,
      "R3d2": 2058,
      "R1f2": 2059,
      " bxc2": 2060,
      "Ref2": 2061,
      "cxd7": 2062,
      "Ngxe4": 2063,
      "84.": 2064,
      "Nbxd7": 2065,
      " Kxc8": 2066,
      " Rce7": 2067,
      "Nhf5": 2068,
      "Rhh1": 2069,
      " Ndc6": 2070,
      "Rdd3": 2071,
      "Nfd7": 2072,
      " Rhh8": 2073,
      " Nxa7": 2074,
      "Kxh8": 2075,
      "Kxc8": 2076,
      " Rec7": 2077,
      " Nfe7": 2078,
      " Nac7": 2079,
      "Bxa2": 2080,
      " Ndf8": 2081,
      " Ncxe4": 2082,
      " Bxa7": 2083,
      "Rda1": 2084,
      " dxe2": 2085,
      "N5c3": 2086,
      " 102.": 2087,
      " Ba1": 2088,
      " Ref7": 2089,
      "Rce2": 2090,
      " Rca8": 2091,
      " cxd2": 2092,
      "Nfd5": 2093,
      " Nxb8": 2094,
      "85.": 2095,
      "Rdf2": 2096,
      "xf8": 2097,
      "Qxh2": 2098,
      " Rcg8": 2099,
      " Nac4": 2100,
      " Rfd7": 2101,
      " bxa2": 2102,
      " Rfg8": 2103,
      " Kxa6": 2104,
      " 103.": 2105,
      " Nexd5": 2106,
      " Rgg8": 2107,
      "Rfe3": 2108,
      " Nbc4": 2109,
      " Ng1": 2110,
      " R8f7": 2111,
      "Rde3": 2112,
      " Nef5": 2113,
      "Rbb7": 2114,
      "Bxh1": 2115,
      "86.": 2116,
      " Nac6": 2117,
      "Nxh2": 2118,
      " Nxh7": 2119,
      "bxc7": 2120,
      "Ba8": 2121,
      "Nfe2": 2122,
      " Rba8": 2123,
      "Ndxb5": 2124,
      " 104.": 2125,
      " Kxa2": 2126,
      " Kxh2": 2127,
      "87.": 2128,
      "N2b3": 2129,
      " Kf1": 2130,
      "Rcg1": 2131,
      "xf1": 2132,
      "R1d3": 2133,
      " Nxa8": 2134,
      " Kg1": 2135,
      "Rfg1": 2136,
      " Bh1": 2137,
      " Rbb7": 2138,
      "Rca1": 2139,
      " Ncb4": 2140,
      " Rbc7": 2141,
      "Rfd3": 2142,
      "R3e2": 2143,
      " Bxh8": 2144,
      " Nce8": 2145,
      "Rcd3": 2146,
      " Ke1": 2147,
      "Nac3": 2148,
      " Rda8": 2149,
      " Rab7": 2150,
      "Qxh1": 2151,
      " Rgc8": 2152,
      "N1f3": 2153,
      "N3d2": 2154,
      "Raa7": 2155,
      " N5b6": 2156,
      " Kxe3": 2157,
      " 105.": 2158,
      " Rbb2": 2159,
      " Nce6": 2160,
      " N8e7": 2161,
      " Ncd5": 2162,
      "Rgg1": 2163,
      "Ndf1": 2164,
      "88.": 2165,
      " Rac7": 2166,
      "Nef4": 2167,
      " Kc1": 2168,
      "Rff3": 2169,
      " Kb1": 2170,
      "Nfxe5": 2171,
      " Kxg2": 2172,
      " Ncxd4": 2173,
      "Rba1": 2174,
      "Ndc3": 2175,
      " Reg8": 2176,
      "bxa7": 2177,
      "N2c3": 2178,
      "Reg1": 2179,
      " Raa7": 2180,
      " fxe2": 2181,
      " Qxh7": 2182,
      " Kxb2": 2183,
      "Bh8": 2184,
      "89.": 2185,
      " Raa2": 2186,
      "Kxb1": 2187,
      " Kxa7": 2188,
      " Kd1": 2189,
      " exd2": 2190,
      " 106.": 2191,
      "Rfc2": 2192,
      " Rdf7": 2193,
      "R4d2": 2194,
      " Qxh8": 2195,
      " Nxg1": 2196,
      " Nec5": 2197,
      " Kxf2": 2198,
      "Nxa1": 2199,
      "N4f3": 2200,
      "Rff7": 2201,
      " Nfd4": 2202,
      "Qxg1": 2203,
      " Rbg8": 2204,
      "Ncxd5": 2205,
      " 107.": 2206,
      " Nfe6": 2207,
      "Ncxe5": 2208,
      "R1e3": 2209,
      " Rfc7": 2210,
      " Rbd7": 2211,
      " Ned4": 2212,
      " Rfxc8": 2213,
      "Rbc2": 2214,
      " Bxb8": 2215,
      " Rae7": 2216,
      " Rcb7": 2217,
      "N2g3": 2218,
      "Nac5": 2219,
      " Ndb6": 2220,
      "Nac4": 2221,
      "Nde5": 2222,
      "Ncd4": 2223,
      "Ngf5": 2224,
      " N8h7": 2225,
      "Nfe3": 2226,
      "Rbb2": 2227,
      " Ndb8": 2228,
      " R6d7": 2229,
      "Rgf3": 2230,
      " R6e7": 2231,
      " 108.": 2232,
      " N7c6": 2233,
      "Nde3": 2234,
      "90.": 2235,
      " Ree6": 2236,
      " Rfe6": 2237,
      " Ncb6": 2238,
      "Rbg1": 2239,
      "Rbd2": 2240,
      "Kxb8": 2241,
      "R3f2": 2242,
      "Nec4": 2243,
      " Red6": 2244,
      "N7": 2245,
      " R8b7": 2246,
      "Nbc5": 2247,
      " Nfxd4": 2248,
      " Rff2": 2249,
      "91.": 2250,
      "Rgc1": 2251,
      "Ref3": 2252,
      "Rab2": 2253,
      " Rad7": 2254,
      " 109.": 2255,
      "Ndf5": 2256,
      "Rac2": 2257,
      " Kxd3": 2258,
      "Rcc3": 2259,
      " Nba6": 2260,
      " Nhf8": 2261,
      "N3h2": 2262,
      " Rha8": 2263,
      "Rha1": 2264,
      "R1b2": 2265,
      " Kh1": 2266,
      " Rdd6": 2267,
      "Rfxf7": 2268,
      " Raf7": 2269,
      "Rdc3": 2270,
      "Rcb2": 2271,
      " Ngf4": 2272,
      "N5f3": 2273,
      "Ned3": 2274,
      " Neg8": 2275,
      "92.": 2276,
      " Ndxc5": 2277,
      "Rdf3": 2278,
      "Nef5": 2279,
      "Rce3": 2280,
      "Raa2": 2281,
      "R3c2": 2282,
      " Neg6": 2283,
      " Rcf7": 2284,
      "Rae2": 2285,
      "Ncd1": 2286,
      " 110.": 2287,
      "dxe3": 2288,
      "R6d2": 2289,
      " Ncxd5": 2290,
      "Ngxe2": 2291,
      "R1a2": 2292,
      " Rcd6": 2293,
      " Nec7": 2294,
      "Nfd3": 2295,
      " R6f7": 2296,
      "Na8": 2297,
      "Rhf3": 2298,
      "Rec3": 2299,
      " Ka1": 2300,
      "Ncd3": 2301,
      " R6c7": 2302,
      " Ncd3": 2303,
      "Rad2": 2304,
      " Ned6": 2305,
      "Nhf1": 2306,
      "Nac2": 2307,
      "R4d3": 2308,
      "Rbc3": 2309,
      "Rge3": 2310,
      "Rcf2": 2311,
      "Rgh1": 2312,
      " 111.": 2313,
      "Ncb4": 2314,
      " Ned3": 2315,
      "Ndb1": 2316,
      "93.": 2317,
      "Rdd6": 2318,
      "Nxg1": 2319,
      " Rch8": 2320,
      " Rgh8": 2321,
      "N4b3": 2322,
      " Rff6": 2323,
      " Rgf7": 2324,
      " Nfg6": 2325,
      "Bxh2": 2326,
      " Nde4": 2327,
      "Nbd5": 2328,
      "94.": 2329,
      " Rde6": 2330,
      "R1c3": 2331,
      "Rch1": 2332,
      " Nec4": 2333,
      "R4e2": 2334,
      " Nbxd7": 2335,
      " N4d5": 2336,
      " Rdb7": 2337,
      " Bxh7": 2338,
      " R5d7": 2339,
      " Rbxc8": 2340,
      " R8c6": 2341,
      " Ncxe7": 2342,
      " 112.": 2343,
      " Rcc6": 2344,
      " Nge6": 2345,
      "R5d2": 2346,
      " R8e6": 2347,
      " Rbc6": 2348,
      "Nfe1": 2349,
      " Na1": 2350,
      "exf8": 2351,
      "Nfxd5": 2352,
      "Neg3": 2353,
      " Rbe7": 2354,
      "Reh1": 2355,
      "Rhg3": 2356,
      " R8d6": 2357,
      "Ndxc4": 2358,
      " Rfg7": 2359,
      "Rdb2": 2360,
      " N7g6": 2361,
      " Ncb8": 2362,
      "95.": 2363,
      "Nge3": 2364,
      " Ndf4": 2365,
      "Nh8": 2366,
      "Ngf1": 2367,
      "R4f2": 2368,
      " Kxc2": 2369,
      "R1g2": 2370,
      " Nef4": 2371,
      " Rab6": 2372,
      "Nce1": 2373,
      "Ncxb5": 2374,
      "Rgf2": 2375,
      "R1d4": 2376,
      " Ngf8": 2377,
      "Rdd8": 2378,
      "Bxg1": 2379,
      "Nfe4": 2380,
      " Ncd6": 2381,
      " R8a7": 2382,
      "R1d6": 2383,
      "R5e2": 2384,
      "Ndb3": 2385,
      "R5e3": 2386,
      "Kxa1": 2387,
      " 113.": 2388,
      "Rfg2": 2389,
      "Rbd3": 2390,
      "Rab3": 2391,
      " Nbd3": 2392,
      "R1f3": 2393,
      " Nde6": 2394,
      "Ndf4": 2395,
      " R4c7": 2396,
      "R8d7": 2397,
      "96.": 2398,
      " Rgg7": 2399,
      "Raf2": 2400,
      "Nab5": 2401,
      " Rgf6": 2402,
      " Rfxe8": 2403,
      " Rfxf2": 2404,
      "Ned6": 2405,
      " Rba7": 2406,
      " N5c6": 2407,
      "Rbe2": 2408,
      " N2": 2409,
      " Rfd6": 2410,
      " Rbf7": 2411,
      " Qxg8": 2412,
      " N6h7": 2413,
      " R5e7": 2414,
      " Rgb8": 2415,
      "N3h4": 2416,
      "Rhg2": 2417,
      "Rfh1": 2418,
      "N6": 2419,
      "R5d3": 2420,
      " 114.": 2421,
      " Reh8": 2422,
      "97.": 2423,
      "Nec5": 2424,
      "Ncb1": 2425,
      " Rca7": 2426,
      "Rhd3": 2427,
      " Rexd8": 2428,
      "Rgg2": 2429,
      "Ncd6": 2430,
      "R4e3": 2431,
      "Rfxc1": 2432,
      "Rfg3": 2433,
      "Red4": 2434,
      "Rgd3": 2435,
      " Reb7": 2436,
      "Rhx": 2437,
      " R5f7": 2438,
      "Rdd4": 2439,
      " R8g7": 2440,
      " N6h5": 2441,
      "Ndc5": 2442,
      " Kxb8": 2443,
      " Raxb8": 2444,
      " 115.": 2445,
      "Nbd6": 2446,
      "Rgx": 2447,
      "Rgg7": 2448,
      " R5c7": 2449,
      "Reb2": 2450,
      "Rbh1": 2451,
      "Ncxd4": 2452,
      " N6d5": 2453,
      "Rfxe1": 2454,
      "Nhg4": 2455,
      " Ngxe7": 2456,
      " Rhg7": 2457,
      " Rfb7": 2458,
      " N3": 2459,
      "Nge5": 2460,
      " Rbh8": 2461,
      " Rdd1": 2462,
      "Rcc8": 2463,
